# Pandas

In [1]:
import pandas as pd

In [7]:
df_cambio = pd.DataFrame({
    "moeda": ['dolar/real', 'libra/real'] * 2,
    "price": [5.24, 4.15, 5.26, 4.23],
    "data": sorted(list(pd.date_range("1/5/2014", periods= 2)) * 2)
})
#data tem um sorted pois o retorno da multiplicação vai adicionar uma nova lista ao fim

df_cambio

        moeda  price       data
0  dolar/real   5.24 2014-01-05
1  libra/real   4.15 2014-01-05
2  dolar/real   5.26 2014-01-06
3  libra/real   4.23 2014-01-06

In [8]:
# como trocar o nome das colunas

print(df_cambio.columns)
df_cambio.columns =["moeda", "cotacao", "data"]
print(df_cambio.columns)

df_cambio

Index(['moeda', 'price', 'data'], dtype='object')
Index(['moeda', 'cotacao', 'data'], dtype='object')

        moeda  cotacao       data
0  dolar/real     5.24 2014-01-05
1  libra/real     4.15 2014-01-05
2  dolar/real     5.26 2014-01-06
3  libra/real     4.23 2014-01-06

In [10]:
#como selecionar colunas
print(df_cambio['cotacao'])
# ==
print(df_cambio.cotacao)
#retorna uma serie com o indice do dataframe e o valor da coluna

0    5.24
1    4.15
2    5.26
3    4.23
Name: cotacao, dtype: float64
0    5.24
1    4.15
2    5.26
3    4.23
Name: cotacao, dtype: float64

In [11]:
#selecionando 2 colunas
print(df_cambio[['cotacao', 'data']])

   cotacao       data
0     5.24 2014-01-05
1     4.15 2014-01-05
2     5.26 2014-01-06
3     4.23 2014-01-06

In [12]:
#vantagem da data como indice
df_cambio = df_cambio.set_index("data")

#o filtro retorna o index data junto
print(df_cambio['cotacao'])

data
2014-01-05    5.24
2014-01-05    4.15
2014-01-06    5.26
2014-01-06    4.23
Name: cotacao, dtype: float64

In [14]:
#selecionando colunas por condições
#selecionando cotacoes menores que 5
cambio_menor_que_5 = df_cambio[df_cambio['cotacao'] < 5]
print(cambio_menor_que_5)

#selecionando o cambio
cambio_dolar = df_cambio[df_cambio['moeda'] == 'dolar/real']
print(cambio_dolar)

                 moeda  cotacao
data
2014-01-05  libra/real     4.15
2014-01-06  libra/real     4.23
                 moeda  cotacao
data
2014-01-05  dolar/real     5.24
2014-01-06  dolar/real     5.26

In [18]:
#selecionando mais de uma condicao
#operadores & e |

# moeda = dolar e cambio > 5.25
cambio_dolar_e_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'dolar/real') & (df_cambio['cotacao'] > 5.25)]

print(cambio_dolar_e_maior_que_525)

# moeda = libra ou cambio > 5.25
cambio_libra_ou_maior_que_525 = df_cambio[(df_cambio['moeda'] == 'libra/real') | (df_cambio['cotacao'] > 5.25) ]
print(cambio_libra_ou_maior_que_525)

#filtrando pelo indice

#libra no dia 5 de janeiro
libra_5_jan = df_cambio[(df_cambio['moeda'] == 'libra/real') & (df_cambio.index == '2014-01-05')]
print(libra_5_jan)

                 moeda  cotacao
data
2014-01-06  dolar/real     5.26
                 moeda  cotacao
data
2014-01-05  libra/real     4.15
2014-01-06  dolar/real     5.26
2014-01-06  libra/real     4.23
                 moeda  cotacao
data
2014-01-05  libra/real     4.15

### Desafio

In [19]:
#importando df
#exercicio 36
dict_desafio = {
    "tickers" : ["WEGE3", "PETR3", "VALE3", "PETR4", "LREN3"],
    "cotacoes": [20, 30, 40, 12, 35],
    "nomes": ['Weg', 'Petro', 'Vale', 'Petro', 'Lojas Renner'],
    "preco_sobre_lucro": [25, 6, 12, 7, 25],
    "volume": [5000, 1000, 4000, 7000, 1200]
    }

dataframe_desafio = pd.DataFrame(dict_desafio, index= [1, 2, 3, 4, 5])
dataframe_desafio = dataframe_desafio.set_index("tickers")
dataframe_desafio.columns = ['preco', 'nomes', 'preco_sobre_lucro', 'volume']
dataframe_desafio

         cotacoes         nomes  preco_sobre_lucro  volume
tickers
WEGE3          20           Weg                 25    5000
PETR3          30         Petro                  6    1000
VALE3          40          Vale                 12    4000
PETR4          12         Petro                  7    7000
LREN3          35  Lojas Renner                 25    1200

In [22]:
#40
dataframe_desafio.columns = ['preco', 'nomes', 'preco_sobre_lucro', 'volume']
dataframe_desafio

         preco         nomes  preco_sobre_lucro  volume
tickers
WEGE3       20           Weg                 25    5000
PETR3       30         Petro                  6    1000
VALE3       40          Vale                 12    4000
PETR4       12         Petro                  7    7000
LREN3       35  Lojas Renner                 25    1200

In [23]:
#41
df_desafio_preco = dataframe_desafio['preco']
print(df_desafio_preco)

tickers
WEGE3    20
PETR3    30
VALE3    40
PETR4    12
LREN3    35
Name: preco, dtype: int64

In [30]:
#42 ultimas duas colunas
ultimas_2_colunas = dataframe_desafio[dataframe_desafio.columns[-2:]]
print(ultimas_2_colunas)

         preco_sobre_lucro  volume
tickers
WEGE3                   25    5000
PETR3                    6    1000
VALE3                   12    4000
PETR4                    7    7000
LREN3                   25    1200

In [32]:
#43 dados petrobras
dataframe_desafio[dataframe_desafio.index == 'PETR3']

         preco  nomes  preco_sobre_lucro  volume
tickers
PETR3       30  Petro                  6    1000

In [33]:
#44 emp com PL menor que 20
dataframe_desafio[dataframe_desafio['preco_sobre_lucro'] < 20]

         preco  nomes  preco_sobre_lucro  volume
tickers
PETR3       30  Petro                  6    1000
VALE3       40   Vale                 12    4000
PETR4       12  Petro                  7    7000

In [34]:
#45 PL > 10 e volume > 2000
dataframe_desafio[(dataframe_desafio['preco_sobre_lucro'] > 10) & (dataframe_desafio['volume'] > 2000)]

         preco nomes  preco_sobre_lucro  volume
tickers
WEGE3       20   Weg                 25    5000
VALE3       40  Vale                 12    4000

In [35]:
#46 preco >20 ou vol > 4000
dataframe_desafio[(dataframe_desafio['preco'] > 20) | (dataframe_desafio['volume'] > 4000)]

         preco         nomes  preco_sobre_lucro  volume
tickers
WEGE3       20           Weg                 25    5000
PETR3       30         Petro                  6    1000
VALE3       40          Vale                 12    4000
PETR4       12         Petro                  7    7000
LREN3       35  Lojas Renner                 25    1200